# Даны два файла, в каждом из которых находится запись многочлена. 
# Задача - сформировать файл, содержащий сумму многочленов.

# После решения 4й задачи мой мозг взорван.. Я буду еще 
# пробовать работать с этой (5) задачей, но мне уже страшно, 
# что меня ждет в следующих домашках :)
# Ооочень медленно получается выполнять домашние задания (я не жалуюсь!:)), 
# поэтому пойду решать следующие, чтобы не отстать совсем от сроков. Немного завидую тем, 
# кто говорит, что им легко и, что материал из 3-4го классов школы, у меня, видимо, была другая школа :)))
